/**
 * =====================================================================
 * 【設定エリア】ここを変更することでプログラムの動きを調整できます
 * ■ 変更のルール
 * ・変更するのは、コロン(:)の「右側」にある、""(ダブルクォーテーション)で囲まれた文字や数字だけです。
 * ・コロンの「左側」や「{」「}」などの記号はプログラムの構造ですので、変更しないように注意してください。
 * 例：AFFILIATION: "所属" ←"所属"の部分だけを書き換えます
 * =====================================================================
 */

const CONFIG = {
  // Googleフォームの質問タイトル (フォームの表記と完全に一致させる)
  QUESTIONS: {
    MESSAGE_1: "送信内容１",
    MESSAGE_2: "送信内容２",
    MESSAGE_3: "送信内容３",
    MESSAGE_4: "送信内容４",
    MESSAGE_5: "送信内容５",
    FB1_MEMBERS: "FB1",
    FB2_MEMBERS: "FB2",
    TR_MEMBERS: "TR"
  },

  // スプレッドシートの見出し名 (タイトルと完全に一致させる)
  // これにより、列の順番が変わっても自動で変更可
  HEADER: {
    FAM_NAME: "名前 (名字のみ)",
    DISP_NAME: "表示名",
    USER_ID: "ユーザーID"
  },

  // スプレッドシートのレイアウト(列番号)の設定
  TABLE: {
    // 見出し(タイトル)がある行
    HEADER_ROW: 1,
    // データが始まる(表の開始)行
    DATA_START_ROW: 2,
    // データが始まる(表の開始)列
    DATA_START_COL: 1
  },

  // 所属
  AFFILIATION: {
    FB1: "FB1",
    FB2: "FB2",
    TR: "TR"
  },

  // 業務ルールの設定
  LABELS: {
    NO_NAME:"なし"
  },

  // スクリプトプロパティのプロパティ名
  // 【注意】
  // ・通常は「スクリプトプロパティ画面」の値(右側)を変更してください。
  // ・画面側の「プロパティ名」(左側)そのものを変えた時のみ、ここ(右側)を書き換えます。
  PROPS: {
    // LINE用のスプレッドシートのID
    LINE_SS_ID: "***",
    // LINEチャンネルアクセストークン
    LINE_CHANNEL_ACCESS_TOKEN: "***",
    // エラー時のSlackのWebhookのURL
    ERR_SLACK_WEBHOOK_URL: "***"
  }
}

/**
 * =====================================================================
 * 設定エリアはここまでです。これより下のコードはエンジニア専用です。
 * =====================================================================
 */